src/test/resources/com/zuora/opg/test/json/stripe_2/creditcardreference/threeds2requesttoken/case_01/createdelayedpaymentIntent_response.json

{
  "id": "pi_3PYj6h4ZWiZesCzm01rUVJwc",
  "object": "payment_intent",
  "amount": 1000,
  "amount_capturable": 0,
  "amount_details": {
    "tip": {}
  },
  "amount_received": 0,
  "application": null,
  "application_fee_amount": null,
  "automatic_payment_methods": null,
  "canceled_at": null,
  "cancellation_reason": null,
  "capture_method": "automatic",
  "charges": {
    "object": "list",
    "data": [],
    "has_more": false,
    "total_count": 0,
    "url": "/v1/charges?payment_intent=pi_3PYj6h4ZWiZesCzm01rUVJwc"
  },
  "client_secret": "pi_3PYj6h4ZWiZesCzm01rUVJwc_secret_QdQlx68jhnLICPU5gNkKKstWg",
  "confirmation_method": "manual",
  "created": 1720074327,
  "currency": "usd",
  "customer": null,
  "description": "Payment Description",
  "invoice": null,
  "last_payment_error": null,
  "latest_charge": null,
  "level3": null,
  "livemode": false,
  "metadata": {},
  "next_action": null,
  "on_behalf_of": null,
  "payment_method": null,
  "payment_method_configuration_details": null,
  "payment_method_options": {
    "card": {
      "installments": null,
      "mandate_options": null,
      "network": null,
      "request_three_d_secure": "automatic"
    }
  },
  "payment_method_types": [
    "card"
  ],
  "processing": null,
  "receipt_email": null,
  "review": null,
  "setup_future_usage": null,
  "shipping": null,
  "source": null,
  "statement_descriptor": null,
  "statement_descriptor_suffix": null,
  "status": "requires_payment_method",
  "transfer_data": null,
  "transfer_group": null
}